# Taps
tap "homebrew/bundle"

# Core CLI tools
brew "fish"
brew "starship"
brew "neovim"
brew "tmux"
brew "git"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "gh"
brew "wget"
brew "curl"

# Modern CLI replacements (https://remysharp.com/2018/08/23/cli-improved)
brew "htop"           # better top
brew "prettyping"     # better ping
brew "diff-so-fancy"  # better git diff
brew "ncdu"           # better du (disk usage)
brew "tldr"           # better man (simplified examples)
brew "entr"           # run commands on file changes
brew "zoxide"         # better cd/autojump

# Development tools
brew "go"
brew "ruby"
brew "rbenv"
brew "pyenv"
brew "node"

# Shell utilities
brew "atuin"
brew "direnv"

# Code formatting
brew "stylua"
brew "prettier"
brew "shellcheck"
brew "black"              # Python formatter (for neovim)
brew "gofumpt"            # Go formatter (for neovim)

# Applications (macOS only)
cask "ghostty"
cask "1password"
cask "docker"
cask "slack"
cask "spotify"
cask "raycast"
cask "font-berkeley-mono" if system("test -d /Applications")
