# Homebrew Bundle
# Run: brew bundle install

# Core CLI tools
brew "just"            # command runner (runs this Brewfile via justfile)
brew "fish"
brew "starship"
brew "neovim"
brew "tmux"
brew "git"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "gh"
brew "wget"
brew "curl"

# Modern CLI replacements (https://remysharp.com/2018/08/23/cli-improved)
brew "htop"           # better top
brew "prettyping"     # better ping
brew "git-delta"      # better git diff pager
brew "difftastic"     # structural diff (AST-aware)
brew "mergiraf"       # structural merge driver
brew "ncdu"           # better du (disk usage)
brew "trash"          # safer rm (moves to Trash)
brew "tldr"           # better man (simplified examples)
brew "entr"           # run commands on file changes
brew "zoxide"         # better cd/autojump
brew "lazygit"        # TUI for git (interactive staging, rebase, etc.)

# Language version managers
brew "rbenv"
brew "ruby-build"     # required for rbenv to install Ruby versions
brew "pyenv"

# Languages (system-level, version managers preferred for projects)
brew "go"
brew "node"

# Shell utilities
brew "atuin"
brew "direnv"
brew "terminal-notifier"  # macOS notifications from CLI (used by claude-notify)

# Code formatting (for Neovim)
brew "stylua"         # Lua
brew "prettier"       # JS/TS/CSS/HTML/JSON
brew "shellcheck"     # Shell scripts
brew "black"          # Python
brew "ruff"           # Python (fast linter/formatter)
brew "gofumpt"        # Go

# macOS Applications
cask "ghostty"
cask "1password"
cask "orbstack"          # Docker alternative (lighter, faster)
cask "slack"
cask "spotify"
cask "raycast"

# Fonts (install manually: Berkeley Mono is a paid font from berkeleygraphics.com)
